src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКлючаСессииМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПараметраКлючаСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыТокеновАвторизацииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыТокеновАвторизацииМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МДЛП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГИСМТРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП/Forms/ФормаПросмотраИАктуализацииТокеновАвторизации/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ор ++
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	Если Параметры.Свойство("ТолькоРазрешительныйРежим") Тогда
		ЭтотОбъект.ТолькоТокеныРазрешительногоРежима = Параметры.ТолькоРазрешительныйРежим;
	КонецЕсли;
	// ор ++
	УстановитьУсловноеОформление();
	НастроитьЭлементыФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьОбновлениеТаблицыТокенов();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТаблицуТокенов(Команда)
	
	ВыполнитьОбновлениеТаблицыТокенов();
	
КонецПроцедуры

&НаКлиенте
Процедура Актуализировать(Команда)
	
	ТокеныДляОбновления = Новый Массив;
	
	Строки = Элементы.Токены.ВыделенныеСтроки;
	
	Для Каждого Строка Из Строки Цикл
		
		Строка = Токены.НайтиПоИдентификатору(Строка);
		
		ДанныеТокена = Новый Структура;
		ДанныеТокена.Вставить("ТипТокенаАвторизации",   Строка.ТипТокенаАвторизации);
		ДанныеТокена.Вставить("Организация",            Строка.Организация);
		
		ТокеныДляОбновления.Добавить(ДанныеТокена);
		
	КонецЦикла;
	
	Если ТокеныДляОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АктуализироватьТокены(ТокеныДляОбновления);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТокеныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Токены.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТипТокенаАвторизации", ТекущиеДанные.ТипТокенаАвторизации);
	ПараметрыОткрытия.Вставить("Организация"         , ТекущиеДанные.Организация);
	ПараметрыОткрытия.Вставить("СозданиеТокена"      , Ложь);
	
	ОткрытьФормуТокенаАвторизации(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТокеныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СозданиеТокена", Истина);
	
	Если Копирование Тогда
		ТекущиеДанные = Элементы.Токены.ТекущиеДанные;
		ПараметрыОткрытия.Вставить("ТипТокенаАвторизации",   ТекущиеДанные.ТипТокенаАвторизации);
		ПараметрыОткрытия.Вставить("Организация",            ТекущиеДанные.Организация);
	Иначе
		ПараметрыОткрытия.Вставить("ТипТокенаАвторизации",   Неопределено);
		ПараметрыОткрытия.Вставить("Организация",            Неопределено);
		// ор ++
		Если ЭтотОбъект.ТолькоТокеныРазрешительногоРежима Тогда
			ПараметрыОткрытия.Вставить("ТипТокенаАвторизации",
				ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница"));
		КонецЕсли;
		// ор --
	КонецЕсли;
	
	ОткрытьФормуТокенаАвторизации(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТокеныПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Токены.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИмяПараметраКлючаСессии", РазрешительныйРежимМДЛПКлиентСервер.ИмяДанныхКлючаСессии(ТекущиеДанные.ТипТокенаАвторизации));
	ПараметрыЗапроса.Вставить("Организация"            , ТекущиеДанные.Организация);
	
	УдалитьТокен(ПараметрыЗапроса);
	
	ВыполнитьОбновлениеТаблицыТокенов();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Токены.Имя);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		Элементы.ТокеныПросрочен.ПутьКДанным, ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияМДЛП);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыНаСервере()
	
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru = 'Токены авторизации'");
	
	Элементы.Токены.ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДанныеКлючаСессииМДЛП);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОбновлениеТаблицыТокенов
#Область ОбновлениеТаблицыТокенов

&НаКлиенте
Процедура ВыполнитьОбновлениеТаблицыТокенов()
	
	Если Элементы.Токены.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Неопределено;
	Иначе
		ТекущиеДанные = Новый Структура("Организация, ТипТокенаАвторизации");
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.Токены.ТекущиеДанные);
	КонецЕсли;
	
	Токены.Очистить();
	
	Данные = ПолучитьДанныеТокеновАвторизации();
	
	Для Каждого ЭлементДанных Из Данные Цикл
		
		Строка = Токены.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ЭлементДанных);
		
		Если Строка.Отсутствует Тогда
			Строка.ВремяДействияСтрокой = НСтр("ru = '<не найден>'");
		ИначеЕсли Строка.Просрочен Тогда
			Строка.ВремяДействияСтрокой = НСтр("ru = '<просрочен>'");
		ИначеЕсли Строка.ТипТокенаАвторизации = ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница") Тогда
			Строка.ВремяДействияСтрокой = НСтр("ru = '<бессрочный>'");
		Иначе
			Строка.ВремяДействияСтрокой = ПредставлениеВремени(Строка.ВремяДействия);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущиеДанные <> Неопределено Тогда
		НайденныеСтроки = Токены.НайтиСтроки(ТекущиеДанные);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.Токены.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеТокеновАвторизации()
	
	Результат = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяДата = ТекущаяУниверсальнаяДата();
	ПустаяДата  = Дата(1,1,1);
	
	Для Каждого Реквизит Из Метаданные.Перечисления.ТипыТокеновАвторизацииМДЛП.ЗначенияПеречисления Цикл
		
		ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизацииМДЛП[Реквизит.Имя];
		
		// ор ++
		Если ЭтотОбъект.ТолькоТокеныРазрешительногоРежима
			И НЕ ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница Тогда
			Продолжить;
		КонецЕсли;
		// ор --
		ИмяПараметраКлючаСессии = РазрешительныйРежимМДЛПКлиентСервер.ИмяДанныхКлючаСессии(ТипТокенаАвторизации);
		Если Не ЗначениеЗаполнено(ИмяПараметраКлючаСессии) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеКлючейСессииПоОрганизациям = РегистрыСведений.ДанныеКлючаСессииМДЛП.ПолучитьСохраненныеДанныеКлючаСессии(ИмяПараметраКлючаСессии);
		Если ДанныеКлючейСессииПоОрганизациям = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ДанныеКлючейСессииПоОрганизациям Цикл
			
			Организация       = КлючИЗначение.Ключ;
			ДанныеКлючаСессии = КлючИЗначение.Значение;
			
			Если ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница Тогда
				ДатаДействияТокена = РазрешительныйРежимМДЛПКлиентСервер.ДатаДействияТокенаГИСМТРозница();
			ИначеЕсли ДанныеКлючаСессии = Неопределено Тогда
				ДатаДействияТокена = ПустаяДата;
			Иначе
				ДатаДействияТокена = ДанныеКлючаСессии.ДействуетДо
			КонецЕсли;
			
			ТокенОтсутствует = ДатаДействияТокена = ПустаяДата;
			
			Если ТокенОтсутствует Тогда
				ВремяДействияТокена = 0;
			Иначе
				ВремяДействияТокена = ДатаДействияТокена - ТекущаяДата;
				Если ВремяДействияТокена < 0 Тогда
					ВремяДействияТокена = 0;
				Иначе
					ВремяДействияТокена = Цел(ВремяДействияТокена / 60) * 60;
				КонецЕсли;
			КонецЕсли;
			
			ТокенПросрочен              = Не ТокенОтсутствует И ВремяДействияТокена = 0;
			ТребуетсяАктуализацияТокена = ТокенОтсутствует Или ТокенПросрочен;
			
			Данные = Новый Структура;
			Данные.Вставить("ТипТокенаАвторизации",   ТипТокенаАвторизации);
			Данные.Вставить("Организация",            Организация);
			Данные.Вставить("ДатаДействия",           ДатаДействияТокена);
			Данные.Вставить("ВремяДействия",          ВремяДействияТокена);
			Данные.Вставить("Отсутствует",            ТокенОтсутствует);
			Данные.Вставить("Просрочен",              ТокенПросрочен);
			Данные.Вставить("ТребуетсяАктуализация",  ТребуетсяАктуализацияТокена);
			
			Результат.Добавить(Данные);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеВремени(ВремяВСекундах)
	
	Результат = "";
	
	ПредставлениеДней  = НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'");
	ПредставлениеЧасов = НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'");
	ПредставлениеМинут = НСтр("ru = ';%1 минута;;%1 минуты;%1 минут;%1 минуты'");
	
	КоличествоДней  = Цел(ВремяВСекундах / 3600 / 24);
	КоличествоЧасов = Цел((ВремяВСекундах - КоличествоДней * 24 * 3600) / 3600);
	КоличествоМинут = Цел((ВремяВСекундах - КоличествоДней * 24 * 3600 - КоличествоЧасов * 3600) / 60);
	
	Если КоличествоДней > 0 Тогда
		Результат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеДней, КоличествоДней);
	КонецЕсли;
	
	Если КоличествоЧасов > 0 Тогда
		Если Результат <> "" Тогда
			Результат = Результат + " ";
		КонецЕсли;
		Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеЧасов, КоличествоЧасов);
	КонецЕсли;
	
	Если КоличествоМинут > 0 Тогда
		Если Результат <> "" Тогда
			Результат = Результат + " ";
		КонецЕсли;
		Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеМинут, КоличествоМинут);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // ОбновлениеТаблицыТокенов

////////////////////////////////////////////////////////////////////////////////
// РедактированиеТокена
#Область РедактированиеТокена

&НаКлиенте
Процедура ОткрытьФормуТокенаАвторизации(ПараметрыОткрытия)
	
	ОткрытьФорму(
		"РегистрСведений.ДанныеКлючаСессииМДЛП.Форма.ФормаТокенаАвторизации",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ПослеИзмененияТокена", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияТокена(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеТаблицыТокенов();
	
КонецПроцедуры

#КонецОбласти // РедактированиеТокена

////////////////////////////////////////////////////////////////////////////////
// УдалениеТокена
#Область УдалениеТокена

&НаСервереБезКонтекста
Процедура УдалитьТокен(ПараметрыЗапроса)
	
	ПараметрыКлючаСессии = РазрешительныйРежимМДЛП.ПараметрыКлючаСессии();
	ПараметрыКлючаСессии.КлючСессии  = "";
	ПараметрыКлючаСессии.ДействуетДо = Дата(1,1,1);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.ДанныеКлючаСессииМДЛП.УстановитьКлючСессии(ПараметрыЗапроса, ПараметрыКлючаСессии);
	
КонецПроцедуры

#КонецОбласти // УдалениеТокена

////////////////////////////////////////////////////////////////////////////////
// АктуализацияТокенов
#Область АктуализацияТокенов

&НаКлиенте
Процедура АктуализироватьТокены(ТокеныДляОбновления)
	
	Если ТокеныДляОбновления.Количество() = 0 Тогда
		
		ВыполнитьОбновлениеТаблицыТокенов();
		
	Иначе
		
		ДанныеТокена = ТокеныДляОбновления[0];
		ТокеныДляОбновления.Удалить(0);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТокеныДляОбновления", ТокеныДляОбновления);
		
		Если ДанныеТокена.ТипТокенаАвторизации = ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница") Тогда
			
			ПараметрыЗапросаКлючаСессии = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница(ДанныеТокена.Организация);
			
			ПослеПолученияКлючаСессии = Новый ОписаниеОповещения("ПослеПолученияКлючаСессии", ЭтотОбъект, ДополнительныеПараметры);
			
			РазрешительныйРежимМДЛПКлиент.ЗапроситьКлючСессии(ПараметрыЗапросаКлючаСессии, ПослеПолученияКлючаСессии);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКлючаСессии(РезультатПолученияКлючейСессийПоОрганизациям, ДополнительныеПараметры) Экспорт
	
	Если РезультатПолученияКлючейСессийПоОрганизациям <> Неопределено Тогда
	
		Для Каждого РезультатПолученияКлючей Из РезультатПолученияКлючейСессийПоОрганизациям Цикл
			
			Если ТипЗнч(РезультатПолученияКлючей.Значение) = Тип("Строка") И ЗначениеЗаполнено(РезультатПолученияКлючей.Значение) Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПолученияКлючей.Значение);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	АктуализироватьТокены(ДополнительныеПараметры.ТокеныДляОбновления);
	
КонецПроцедуры

#КонецОбласти // АктуализацияТокенов

#КонецОбласти // СлужебныеПроцедурыИФункции
